In [1]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

In [3]:
series_obj = Series(np.arange(8), index=['row 1', 'row 2', 'row 3', 'row 4', 'row 5', 'row 6', 'row 7', 'row 8'])
series_obj

row 1    0
row 2    1
row 3    2
row 4    3
row 5    4
row 6    5
row 7    6
row 8    7
dtype: int32

In [8]:
series_obj['row 2']

1

In [5]:
series_obj['row 2':'row 5']

row 2    1
row 3    2
row 4    3
row 5    4
dtype: int32

In [7]:
series_obj[['row 1', 'row 4']]

row 1    0
row 4    3
dtype: int32

In [9]:
series_obj[3]

3

In [11]:
series_obj[[3, 5]]

row 4    3
row 6    5
dtype: int32

In [12]:
series_obj[3:5]

row 4    3
row 5    4
dtype: int32

In [15]:
np.random.seed(25)
DF_obj = DataFrame(np.random.rand(36).reshape(6, 6), 
                   index=['row 1', 'row 2', 'row 3', 'row 4', 'row 5', 'row 6'], 
                   columns=['col 1', 'col 2', 'col 3', 'col 4', 'col 5', 'col 6'])
DF_obj

          col 1     col 2     col 3     col 4     col 5     col 6
row 1  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
row 2  0.684969  0.437611  0.556229  0.367080  0.402366  0.113041
row 3  0.447031  0.585445  0.161985  0.520719  0.326051  0.699186
row 4  0.366395  0.836375  0.481343  0.516502  0.383048  0.997541
row 5  0.514244  0.559053  0.034450  0.719930  0.421004  0.436935
row 6  0.281701  0.900274  0.669612  0.456069  0.289804  0.525819

In [27]:
DF_obj.loc['row 1', 'col 2']

0.5822769286725598

In [28]:
DF_obj.loc[['row 1', 'row 3'], ['col 3', 'col 5']]

          col 3     col 5
row 1  0.278839  0.411100
row 3  0.161985  0.326051

In [29]:
DF_obj.loc['row 2':'row 5', 'col 3': 'col 6']

          col 3     col 4     col 5     col 6
row 2  0.556229  0.367080  0.402366  0.113041
row 3  0.161985  0.520719  0.326051  0.699186
row 4  0.481343  0.516502  0.383048  0.997541
row 5  0.034450  0.719930  0.421004  0.436935

In [32]:
x = DF_obj[DF_obj > 0.2]
x

          col 1     col 2     col 3     col 4     col 5     col 6
row 1  0.870124  0.582277  0.278839       NaN  0.411100       NaN
row 2  0.684969  0.437611  0.556229  0.367080  0.402366       NaN
row 3  0.447031  0.585445       NaN  0.520719  0.326051  0.699186
row 4  0.366395  0.836375  0.481343  0.516502  0.383048  0.997541
row 5  0.514244  0.559053       NaN  0.719930  0.421004  0.436935
row 6  0.281701  0.900274  0.669612  0.456069  0.289804  0.525819

In [36]:
series_obj[series_obj > 5] = 8
series_obj

row 1    0
row 2    1
row 3    2
row 4    3
row 5    4
row 6    5
row 7    8
row 8    8
dtype: int32

In [37]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

In [38]:
missing = np.nan
missing

nan

In [39]:
series_obj = Series(['row 1', 'row 2', missing, 'row 4', 'row 5', 'row 6', missing, 'row 8'])
series_obj

0    row 1
1    row 2
2      NaN
3    row 4
4    row 5
5    row 6
6      NaN
7    row 8
dtype: object

In [40]:
series_obj.isnull()

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7    False
dtype: bool

In [41]:
np.random.seed(25)
DF_obj = DataFrame(np.random.rand(36).reshape(6,6))
DF_obj

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366  0.113041
2  0.447031  0.585445  0.161985  0.520719  0.326051  0.699186
3  0.366395  0.836375  0.481343  0.516502  0.383048  0.997541
4  0.514244  0.559053  0.034450  0.719930  0.421004  0.436935
5  0.281701  0.900274  0.669612  0.456069  0.289804  0.525819

In [42]:
DF_obj.loc[3:5,0] = missing
DF_obj.loc[1:4,5] = missing
DF_obj

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366       NaN
2  0.447031  0.585445  0.161985  0.520719  0.326051       NaN
3       NaN  0.836375  0.481343  0.516502  0.383048       NaN
4       NaN  0.559053  0.034450  0.719930  0.421004       NaN
5       NaN  0.900274  0.669612  0.456069  0.289804  0.525819

In [43]:
DF_obj.isnull()

       0      1      2      3      4      5
0  False  False  False  False  False  False
1  False  False  False  False  False   True
2  False  False  False  False  False   True
3   True  False  False  False  False   True
4   True  False  False  False  False   True
5   True  False  False  False  False  False

In [44]:
DF_filled = DF_obj.fillna(0)
DF_filled

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366  0.000000
2  0.447031  0.585445  0.161985  0.520719  0.326051  0.000000
3  0.000000  0.836375  0.481343  0.516502  0.383048  0.000000
4  0.000000  0.559053  0.034450  0.719930  0.421004  0.000000
5  0.000000  0.900274  0.669612  0.456069  0.289804  0.525819

In [45]:
DF_filled = DF_obj.fillna({0:0.2, 5:1.25})
DF_filled

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366  1.250000
2  0.447031  0.585445  0.161985  0.520719  0.326051  1.250000
3  0.200000  0.836375  0.481343  0.516502  0.383048  1.250000
4  0.200000  0.559053  0.034450  0.719930  0.421004  1.250000
5  0.200000  0.900274  0.669612  0.456069  0.289804  0.525819

In [46]:
DF_filled = DF_obj.fillna(method='ffill')
DF_filled

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366  0.117376
2  0.447031  0.585445  0.161985  0.520719  0.326051  0.117376
3  0.447031  0.836375  0.481343  0.516502  0.383048  0.117376
4  0.447031  0.559053  0.034450  0.719930  0.421004  0.117376
5  0.447031  0.900274  0.669612  0.456069  0.289804  0.525819

In [47]:
DF_obj.isnull().sum()

0    3
1    0
2    0
3    0
4    0
5    4
dtype: int64

In [49]:
DF_obj.isnull().sum(axis=1)

0    0
1    1
2    1
3    2
4    2
5    1
dtype: int64

In [50]:
DF_no = DF_obj.dropna()
DF_no

          0         1         2         3       4         5
0  0.870124  0.582277  0.278839  0.185911  0.4111  0.117376

In [51]:
DF_no = DF_obj.dropna(axis=1)
DF_no

          1         2         3         4
0  0.582277  0.278839  0.185911  0.411100
1  0.437611  0.556229  0.367080  0.402366
2  0.585445  0.161985  0.520719  0.326051
3  0.836375  0.481343  0.516502  0.383048
4  0.559053  0.034450  0.719930  0.421004
5  0.900274  0.669612  0.456069  0.289804

In [52]:
DF_obj= DataFrame({'column 1':[1,1,2,2,3,3,3],
                   'column 2':['a', 'a','b', 'b', 'c', 'c', 'c'],
                   'column 3':['A', 'A', 'B', 'B', 'C', 'C', 'C']})
DF_obj

   column 1 column 2 column 3
0         1        a        A
1         1        a        A
2         2        b        B
3         2        b        B
4         3        c        C
5         3        c        C
6         3        c        C

In [53]:
DF_obj.duplicated()

0    False
1     True
2    False
3     True
4    False
5     True
6     True
dtype: bool

In [54]:
DF_obj.drop_duplicates()

   column 1 column 2 column 3
0         1        a        A
2         2        b        B
4         3        c        C